<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d2ffbe3ded1a7d70434703eda8e4d919498bc6fddca9ad167f036abe36dd933a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #828 at https://github.com/cal-itp/data-infra/actions/runs/18699532348","plan_out_hash":"a58b6a4da75d9acca20b843d50fb19713bf499720db6fb33b0cfa994e8753484","plan_hash":"58488130a05dd7b2193b3cfd8aad93ccafce1feb152ce97d62cdd85b3a357338","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/parse_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "/x/Fcg==" -> (known after apply)
!~      detect_md5hash      = "CElUl9YjpaCAGPtnLRUFCw==" -> "different hash"
!~      generation          = 1753225938528711 -> (known after apply)
        id                  = "calitp-composer-dags/parse_elavon/METADATA.yml"
!~      md5hash             = "CElUl9YjpaCAGPtnLRUFCw==" -> (known after apply)
        name                = "dags/parse_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_elavon/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "vJCzsQ==" -> (known after apply)
!~      detect_md5hash      = "WZSz+bbxdl6QADm1OZD99g==" -> "different hash"
!~      generation          = 1753225938553530 -> (known after apply)
        id                  = "calitp-composer-dags/sync_elavon/METADATA.yml"
!~      md5hash             = "WZSz+bbxdl6QADm1OZD99g==" -> (known after apply)
        name                = "dags/sync_elavon/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_elavon/elavon_to_gcs_raw.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "nHSPtA==" -> (known after apply)
!~      detect_md5hash      = "UMvMXxwmMOnEnlEhE27pDw==" -> "different hash"
!~      generation          = 1760992274065600 -> (known after apply)
        id                  = "calitp-composer-dags/sync_elavon/elavon_to_gcs_raw.py"
!~      md5hash             = "UMvMXxwmMOnEnlEhE27pDw==" -> (known after apply)
        name                = "dags/sync_elavon/elavon_to_gcs_raw.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #828](https://github.com/cal-itp/data-infra/actions/runs/18699532348)